export interface InstructionSection {
  id: string;
  title: string;
  contentHtml: string;
}

export const instructionSections: InstructionSection[] = [
  {
    id: "nirandhanangal",
    title: "நிபந்தனைகள்",
    contentHtml: `
      <p><strong>குண்டலினி யோகத்தின் முழுப் பயனையும் பெற கீழ்க்கண்ட ஒழுங்கு முறைகளை நீங்கள் பின்பற்ற வேண்டும்:-</strong></p>
      <ul>
        <li>புகைப்பிடித்தல் கூடாது. புகையிலையை எந்த வகையிலும் பயன்படுத்தக் கூடாது.
</li>
        <li>லாகிரி வஸ்துக்களையோ, மயக்க மாத்திரைகளையோ பயன்படுத்தக் கூடாது.
</li>
<li>சாந்தியோகம் பெறும் வரை பிரம்மச்சர்ய விரதத்தில் இருத்தல் வேண்டும்.
</li>
<li>பெண்கள் மாதவிலக்கு காலத்தில் முதல் 3 நாட்கள் தவத்தில் ஈடுபடலாகாது.
</li>
      </ul>
      
    `,
  },
  {
    id: "thava-murai",
    title: "தவமுறை",
    contentHtml: `
      <p>அமைதியாகத் தனியிடத்தில் ஒரு விரிப்பு/பாய் மீது அமர்ந்து கொண்டு ஆசான் காட்டியபடி இரண்டு கைவிரல்களையும் கோர்த்து மடியில் வைத்துக் கொள்ளுங்கள். அடுத்து, பார்வையை நாசி நுனியில் வைத்துக் கொள்ளுங்கள். பிறகு கண்களை மூடிக் கொள்ளுங்கள்.
ஆசான் சொல்லியபடி புருவ மத்தியில் குண்டலினி சக்தியின் அதிர்வலைகளைக் கவனியுங்கள்.</p>
    `,
  },
  {
    id: "thava-thodakam",
    title: "தவத் தொடக்கம்",
    contentHtml: `
      <p>ஒவ்வொரு முறையும் தவம் தொடங்கும் முன் நாடிசுத்தி ஐந்து நிமிடம், தண்டுவட சுத்தி ஐந்து நிமிடம் செய்து விட்டுத் துவங்க வேண்டும்.</p>
    <ol>
    <li>கீழ்க்கண்டவாறு சொல்லிக் கொள்ளுங்கள்:- <blockquote>'நான் அமர்ந்துள்ள இடத்தைச் சுற்றிலும் நல்ல தெய்வீக ஆற்றலே நிரம்பின'. <blockquote>(மூன்று முறை)</li>
    <li><blockquote>அருட்பேராற்றல் உடலிலே, உயிரிலே, அலை அலையாகப் பாய்வதை உணர்கிறேன்'. (மூன்று முறை) <blockquote></li>
    <li>அருட்பேராற்றல் இரவும், பகலும் எல்லா நேரங்களிலும், எல்லா இடங்களிலும், எல்லாத் தொழில்களிலும் உறுதுணையாகவும், பாதுகாப்பாகவும், வழிநடத்துவதாகவும் அமையுமாக. (ஒரு முறை)</li>
   <li><blockquote>அன்னைக்கு வணக்கம், தந்தைக்கு வணக்கம், ஆசான் அருள்தந்தை வேதாத்திரி மகரிஷி அவர்களுக்கு வணக்கம்<blockquote>
   
</li>
 என மனக்கண் முன் அவர்களுடைய உருவங்களை மனதில் கொண்டு வந்து மானசீகமாக வணங்குங்கள்.
பின்னர்தான் குண்டலினி சக்தியை <strong>ஆக்கினைச்</strong> சக்கரத்தில் வைத்துக் கூர்ந்து கவனிக்க வேண்டும்.

    <ol>
      `,
  },
  {
    id: "thava-mudivil",
    title: "தவ முடிவில்",
    contentHtml: `<ol>
    <li><blockquote>அருட்பேராற்றல் கருணையினால் உடல் நலம், நீளாயுள், நிறை செல்வம், உயர் புகழ், மெய்ஞ்ஞானம் ஓங்கி வாழ்வேன்' என்று சங்கல்பம் செய்யுங்கள். (மூன்று முறை)<blockquote>
</li>
    <li>அடுத்து, உங்கள் வாழ்க்கைத் துணைவருக்கு வாழ்த்துக் கூறுங்கள். (மனைவியின் / கணவரின் உருவத்தை மனக்கண் முன் கொண்டு வந்து <strong>“வாழ்க வளமுடன்”</strong> என்று வாழ்த்துங்கள்).
</li>
    <li>தொடர்ந்து, உங்கள் குழந்தைகளை வயதுக் கிரமமாக ஒவ்வொருவராக மனக்கண் முன் கொண்டு வந்து <strong>'வாழ்க வளமுடன்'</strong> என்று வாழ்த்துங்கள்.
</li>
    <li>பின்னர், அதே போல சகோதர, சகோதரிகளை வாழ்த்துங்கள்.</li>
    <li>அடுத்து நெருங்கிய உறவினர்களுக்கு, நண்பர்களுக்கு வாழ்த்து கூறுங்கள்.
</li>
    <li>உங்கள் தொழில் துறையிலே, தினசரி கடமைகளிலே, உங்களோடு நெருங்கிய தொடர்புடையவர்களுக்கு வாழ்த்து கூறுங்கள்.
</li>
    <li>இன்னல் புரிவோர், எதிரிகளாக நினைப்போர் இருந்தால் அவர்களும் மனம் திருந்தி நல்வாழ்வு பெற கருணையோடு வாழ்த்துங்கள்.
</li>
    <li>ஆசான் அருள்தந்தை அவர்கள் அருளிய 'வேதாத்திரியத்தை' வாழ்த்துங்கள்.</li>
    <li>உலக சமுதாய சேவா சங்கத்தை வாழ்த்துங்கள்.</li>
    <li>ஆழியாறு அறிவுத் திருக்கோயிலை வாழ்த்துங்கள்.
</li>
<li>உள்ளூர் அறக்கட்டளையை வாழ்த்துங்கள்.</li>
<li>உள்ளூர் தவமையத்தை வாழ்த்துங்கள்.</li>
<li>இரண்டொழுக்கப் பண்பாடு : <blockquote>“நான் எனது வாழ்நாளில் யாருடைய உடலுக்கும், மனதுக்கும் துன்பம் தரமாட்டேன். துன்பப்படுவோர்க்கு என்னால் முடிந்த உதவிகளைச் செய்வேன். (மூன்று முறை)</blockquote></li>
<li>வாழ்க வையகம், வாழ்க வளமுடன்.</li>
<li>
  <div class="poem-wrap">
    

    <blockquote class="poem">
    <strong>உலக நல வேட்பு</strong><br/>
    
      உலகிலுள்ள பொறுப்புடைய தலைவரெல்லாம்<br />
      உயிரறிவை உள்ளுணர்வாய்ப் பெறுதல் வேண்டும்.<br />
      உலகனைத்து நாடுகளின் எல்லை காக்க,<br />
      ஓருலகக் கூட்டாட்சி வலுவாய் வேண்டும்.<br />
      உலகில்போர், பகைஅச்ச மின்றி, மக்கள்<br />
      உழைத்துண்டு, வளம்காத்து, வாழ வேண்டும்.<br />
      உலகெங்கும் மனிதகுலம் அமைதி என்னும்<br />
      ஒரு வற்றாத நன்னிதிபெற் றுய்ய வேண்டும். (ஒரு முறை)
    </blockquote>
  </div>
</li>
<li>வாழ்க வையகம், வாழ்க வளமுடன்.</li>
<li> <div class="poem-wrap">
    

    <blockquote class="poem">
    <strong>மழை வாழ்த்து</strong><br/>
    
      ஏரி, குளம், கிணறு, ஆறு எல்லாம் நிரம்பி வழிய,<br/>
மாரி அளவாய்ப் பொழிக; மக்கள் வளமாய் வாழ்க. (மூன்று முறை)

    </blockquote>
  </div></li>
<li>வாழ்க வையகம், வாழ்க வளமுடன்.</li>
<li>முடிவாக,<blockquote> “நம் மனதில் அமைதி நிலவட்டும், நம்மைச் சுற்றிலும் அமைதி நிலவட்டும், உலகம் முழுவதும் அமைதி நிலவட்டும். அமைதி. அமைதி, அமைதி"</blockquote> எனக் கூறி தவத்தை நிறைவு செய்து கொள்ளுங்கள். (கைகளை அதிக ஓசையின்றித் தேய்த்து, கண்களில் வைத்து, பின் முகத்தைத் தடவி இருகைகளையும் தலைக்கு மேல் தூக்கி ஓர் ஆழமான மூச்சு இழுத்து விட வேண்டும், பிறகு கைகளை இறக்கிக் கொண்டு கண்களைத் திறக்க வேண்டும்.)
</li>
<li>
  <div class="poem-wrap">
    

    <blockquote class="poem">
    <strong>உலக நல வாழ்த்து</strong><br/>
    
     உலகமெலாம் பருவமழை ஒத்தபடி பெய்யட்டும்.</br>
உழவரெலாம் தானியத்தை உவப்புடனே பெருக்கட்டும்.</br>
பலதொழில்கள் புரிகின்ற பாட்டாளி உயரட்டும்.</br>
பகுத்துணர்வில் தொகுத்துணர்வு பண்பாட்டை உயர்த்தட்டும்.</br>
கலகங்கள் போட்டிபகை கடந்தாட்சி நடக்கட்டும்.</br>
கல்லாமை கடன்வறுமை களங்கங்கள் மறையட்டும்.</br>
நலவாழ்வை அளிக்கும்மெய்ஞ் ஞானஒளி வீசட்டும்.</br>
நம்கடமை அறவாழ்வின் நாட்டத்தே சிறக்கட்டும்.</br>
(இந்தக் கடைசி வரியை மூன்று முறை சொல்லவும்)
    </blockquote>
  </div>
</li>

    </ol>`,
  },
];
