export type PayirchiType = "table" | "paragraph";

export interface Payirchi {
  id: string;
  title: string;
  image: string;
  type: PayirchiType;

  tableData?: {
    name: string;
    benefits: string[];
  }[];

  paragraph?: {
    heading?: string;
    blocks: string[];
    bullets?: string[];
  };
}

export const payirchigal: Payirchi[] = [
  {
    id: "simplified_exercises",
    title: "எளியமுறை உடற்பயிற்சி",
    image: "/yoga_posture.png",
    type: "table",
    tableData: [
      {
        name: "கை பயிற்சி",
        benefits: [
          `கைகளில் இரத்த ஓட்டம், வெப்ப ஓட்டம், காற்றோட்டம் சீரடையும்.
கைகள் தோள்கள் பலமடைகின்றன.
கை, கால் குடைச்சல் நீங்கும்.
தோள் பட்டை வலி, முழங்கால் வலி குணமடையும்.`,
        ],
      },
      {
        name: "கால் பயிற்சி",
        benefits: [
          `கால்கள் பலமடைகின்றன.
கீழ் வாதம், முழங்கால் வலி குணமடைகின்றன.`,
        ],
      },
      {
        name: "நரம்பு தசை நார் மூச்சுப் பயிற்சி",
        benefits: [
          `ஆஸ்துமா, வாய், மறதி, சோம்பல், அடிக்கடி சளி பிடித்தல்,
சைனஸ் தொந்தரவு முதலியவை நீங்கும்.
நுரையீரல் பலம் பெறும்.`,
        ],
      },
      {
        name: "கண் பயிற்சி",
        benefits: [
          `கண் நோய்கள், கண் வலி, எரிச்சல் நீங்கும்.
கண் பார்வை மேம்படும்.`,
        ],
      },
      {
        name: "கபாலபதி",
        benefits: [`சைனஸ், ஈசினோபோலியா போன்ற நோய்கள் சரியாகும்.`],
      },
      {
        name: "மகராசனம்",
        benefits: [
          `சர்க்கரை நோய், இடுப்பு வலி, முதுகு வலி, கழுத்து வலி குணமாக உதவுகிறது.
மாதவிடாய் கோளாறுகள், கருப்பை கோளாறுகள் சீரடையும் மலட்டுத்தன்மை சரியாகும் .`,
        ],
      },
      {
        name: "உடலை தேய்த்து விடுதல் (மசாஜ்)",
        benefits: [
          `உடலில் ஜீவகாந்த ஓட்டம் சீரடையும்.
முகப்பொலிவு உண்டாகும்.`,
        ],
      },
      {
        name: "அக்குபிரஷர்",
        benefits: [
          `உயர் இரத்த அழுத்தம் சீராகும்.
நரம்பு மண்டலம் சீராகும்.
இதய நோய் வராமல் தடுக்க உதவும்.
உறக்கமின்மை சீராகும்.`,
        ],
      },
      {
        name: "உடல் தளர்த்தல்",
        benefits: [
          `உடலுக்கும் மனதுக்கும் அமைதி உண்டாகும்.
உடல் முழுவதும் ஓய்வு கிடைக்கும்.
நாள் முழுவதும் சுறுசுறுப்புடன் இருக்க உதவுகிறது.`,
        ],
      },
    ],
  },
  {
    id: "simplified_kayakalpa",
    title: "காய கல்ப பயிற்சி",
    image: "/yoga_posture.png",
    type: "paragraph",
    paragraph: {
      heading: "நன்மைகள் :",
      blocks: [
        `இளமையோடு வாழ, நோயின்றி வாழ, மரணத்தை தள்ளிப் போட உதவும் சித்தர்களின் கலை.
அனைத்து விதமான நோய்களும் குணமாக உதவும் அற்புதமான பயிற்சி.
பெண்களுக்கு மாதவிடாய் தொந்தரவுகள் குணமாகும்.
நல்ல குழந்தைப் பேறு கிடைக்க உதவும்.
மாணவர்களுக்கு நல்ல நினைவாற்றல் பெருகும்.
மனம் திடமாகவும், தைரியமாகவும் இருக்க உதவும்.`,
      ],
      bullets: [],
    },
  },
  {
    id: "simplified_meditation",
    title: "எளிய முறை தியான பயிற்சி",
    image: "/yoga_posture.png",
    type: "table",
    tableData: [
      {
        name: "ஆக்கினை",
        benefits: [
          `அறிவு விழிப்பு நிலைக்கு வரும். ஞாபக சக்தி அதிகரிக்கும், புரிந்து கொள்ளும் திறன் அதிகரிக்கும். மாணவ, மாணவியருக்கு கல்வியில் சிறப்பாக உதவும். மனம் ஓர்மைப்படும் .`,
        ],
      },
      {
        name: "சாந்தி யோகம்",
        benefits: [
          `தவ ஆற்றல் உடல் ஆற்றலாக மாற்றப்படும் . உடல் சூடு சமனாகும் . ஜீரண சக்தி அதிகமாகும்.`,
        ],
      },
      {
        name: "துரியம்",
        benefits: [
          `மூளைத்திறன்  அதிகரிக்கும். எண்ணங்களுக்கு வலு அதிகரிக்கும்.
நமது வாழ்த்துக்கள்  விரைவில் நிறைவேறும்.
மன அலைச்சுழல்  குறைந்து மனோசக்தி அதிகமாகும்.`,
        ],
      },
      {
        name: "பஞ்சேந்திரியம்",
        benefits: [
          `மேய் , வாய், மூக்கு, கண்கள், காதுகள் என்று
ஐம்புலன்களில் காந்த ஆற்றல் பெருகி பலமடைகின்றன.
புலன்கள் அறிவின் கட்டுப்பாட்டில் வரும்.
புலன் இயங்கங்கள் சீராகும்.`,
        ],
      },
      {
        name: "பஞ்சபூத நவகிரக தவம்",
        benefits: [
          `பஞ்ச பூதங்கள், நவகிரகங்களில் இருந்து வரும் காந்த
அலைகள் நமக்கு ஏற்றதாக மாற்றிக்கொள்ள உதவும்.
கிரக தோஷங்கள் நீங்கும்.
வாழ்வில் எல்லா நன்மைகளும் உண்டாகும்.
உடல், மன ஆற்றல் அதிகரிக்கும்.`,
        ],
      },
      {
        name: "துரியாதீதம்",
        benefits: [
          `பிரபஞ்ச ஆற்றல் கிடைக்கும்.
இறையுணர்வு கிடைக்கும்.
மனம் தீட்டா, டெல்டா  அலைச்சுழலுக்கு வரும் .`,
        ],
      },
      {
        name: "ஒன்பது மைய தவம்",
        benefits: [
          `உடலில் உள்ள நாளமில்லா சுரப்பிகள்
(Duck Less Glands) நன்கு வேலை செய்யும்.
கல்லீரல், மண்ணீரல், சிறுநீரகம் , ஜீரண மண்டலம்,
இருதயம் , நுரையீரல் போன்ற உள்ளுறுப்புகள்
நன்றாக இயங்கும்.
மனத்திற்கு உள்ளுணர்வு (ESP) கிடைக்கும்.`,
        ],
      },
      {
        name: "நித்தியானந்த தவம்",
        benefits: [
          `உடலின் ஒவ்வொரு செல்களிலும் ஜீவகாந்த ஆற்றல் பெருகும்.
உடலும் மனமும் புத்துணர்ச்சி பெறும்.`,
        ],
      },
    ],
  },
  {
    id: "simplified_agathaivu",
    title: "அகத்தாய்வு பயிற்சிகள்",
    image: "/yoga_posture.png",
    type: "paragraph",
    paragraph: {
      heading: "பயிற்சிகள் :",
      blocks: [``],
      bullets: [
        "எண்ணம் ஆராய்தல்",
        "ஆசை சீரமைத்தல்",
        "சினம் தவிர்த்தல்",
        "கவலை ஒழித்தல்",
        "வாழ்த்தும் பயனும் ",
        "நான் யார்?",
        "மௌனத்தின் மேன்மை",
        "குடும்ப அமைதி",
        "பெண்ணின் பெருமை",
        "பாவப்பதிவுகளும் போக்கும் வழிகளும் ",
        "நற்பண்புகள்",
        "மனிதருள் வேறுபாடு ஏன்?",
        "உயிரும் மனமும்",
        "அறுகுண சீரமைப்பு",
        "கர்ம யோகம்",
      ],
    },
  },
  {
    id: "simplified_gazing",
    title: "ஜீவ காந்த பெறுக்கு பயிற்சிகள்",
    image: "/yoga_posture.png",
    type: "paragraph",
    paragraph: {
      heading: "பயிற்சிகள் :",
      blocks: [
        `ஜீவகாந்தம் பெருகும், முகவசியம், ஜெக வசியம் கிடைக்கும்.
உடலும் மனமும் பொலிவு பெறும்.
கன்ம நோய்கள் குணமாகும்.
பிறரது  நோய் தீர்க்க முடியும்.
மேற்கண்ட பயிற்சிகளை கற்று தேர்ந்தவர்கள் பொள்ளாச்சி அருகில் உள்ள ஆழியார் சென்று பிரம்ம ஞான விளக்க பயிற்சி மற்றும் அருள் நிதியர்  பயிற்சியில் கலந்து கொள்ளலாம்.
அங்கு இறைநிலை தவம் கற்றுக்கொடுக்கப்படும்.`,
      ],
      bullets: ["விளக்கு பயிற்சி", "கண்ணாடி பயிற்சி"],
    },
  },
];
