import { Program } from "../../app/types/program";

export const programs_2026_02: Program[] = [
  {
    id: "basic-yoga-01-02-2026",
    title: "அடிப்படை யோகம் பயிற்சி",
    programType: "range",
    monthKey: "2026-02",

    startDate: "2026-02-01",
    endDate: "2026-02-12",
    description: `<h3>வகுப்பில் என்னென்ன தெரிந்து கொள்ளலாம்?</h3>
   <ol>
      <li>காயகல்பம் பயிற்சி</li>
      <li>எளியமுறை உடற்பயிற்சிகள்</li>
      <li>ஆசனங்கள்</li>
      <li>தவங்கள்</li>
      <li>யோக தத்துவங்கள்</li>
    </ol>
  `,
  },

  {
    id: "மௌனம்-01-02-2026",
    title: "பௌர்ணமி மௌனம் ",
    programType: "single",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-02",
    instructors: ["துணை பேராசிரியர். வாணி ஸ்ரீகாந்த்"],
    startDate: "2026-02-01",
  },
  {
    id: "வியாழன்-மௌனம்-05-02-2026",
    title: "பௌர்ணமி மௌனம் ",
    programType: "single",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-02",
    instructors: ["துணை பேராசிரியர். சஞ்சய் ஸ்ரீனிவாசன் "],
    startDate: "2026-02-05",
  },
  {
    id: "அகத்தாய்வு-22-02-2026",
    title: "அகத்தாய்வு 1",
    programType: "range",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை. சனி, ஞாயிறு",
    monthKey: "2026-02",
    startDate: "2026-02-07",
    endDate: "2026-02-08",
  },

  {
    id: "ஆசிரியர்-திறன்-08-02-2026",
    programType: "single",
    title: "ஆசிரியர் திறன் மேம்பாட்டு பயிற்சி ",
    startDate: "2026-02-08",
    monthKey: "2026-02",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",

    instructors: ["முதுநிலை பேராசிரியர். ஆர். சேர்மா செல்வராஜ்"],
  },
  {
    id: "அமாவாசை-16-02-2026",
    title: "அமாவாசை  மௌனம் ",
    programType: "single",
    time: "காலை 10.30 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-02",
    startDate: "2026-02-16",
  },

  {
    id: "ஆழ்நிலை-தியானம்-22-02-2026",
    title: "ஆழ்நிலை தியானம்",
    programType: "single",
    monthKey: "2026-02",
    location: {
      name: "குரோம்பேட்டை ராதா நகர் மனவளக்கலை மன்றம் அறக்கட்டளை",
      address: "No. 7 ஏழு ஏழுமலை தெரு ராதா நகர் குரோம்பேட்டை",
      mapUrl: "https://g.co/kgs/YKNV6g",
    },
    time: "ஞாயிற்றுக்கிழமை காலை 9.45 முதல் மாலை 4 மணி வரை",
    description:
      "தகுதி அகத்தாய்வு மூன்றாம் நிலை முடித்திருக்க வேண்டும்.அன்பர்கள் அனைவருக்கும் உணவுவழங்கப்படுவதால் எல்லோரும் பெயரை பதிவு செய்து கொள்ள வேண்டுகிறோம்  வாழ்க வளமுடன் ",
    contacts: ["9884374090", "9962206217"],

    startDate: "2026-02-22",
  },
];
