import { Program } from "../../app/types/program";

export const programs_2026_06: Program[] = [
  {
    id: "basic-yoga-01-06-2026",
    title: "அடிப்படை யோக பயிற்சி",
    programType: "range",
    monthKey: "2026-06",

    startDate: "2026-06-01",
    endDate: "2026-06-12",
    description: `<h3>வகுப்பில் என்னென்ன தெரிந்து கொள்ளலாம்?</h3>
   <ol>
      <li>காயகல்பம் பயிற்சி</li>
      <li>எளியமுறை உடற்பயிற்சிகள்</li>
      <li>ஆசனங்கள்</li>
      <li>தவங்கள்</li>
      <li>யோக தத்துவங்கள்</li>
    </ol>
  `,
  },
  {
    id: "வியாழன்-மௌனம்-04-06-2026",
    title: "வியாழன்-மௌனம்",
    programType: "single",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-02",
    instructors: ["துணை பேராசிரியர். சஞ்சய் ஸ்ரீனிவாசன் "],
    startDate: "2026-06-04",
  },
  {
    id: "kaayakalpa-2026-06-07",
    title: "காயகல்ப பயிற்சி",
    programType: "single",
    monthKey: "2026-06",

    description: `<h3>காயகல்ப பயிற்சி</h3>
   <ol>
      <li>நோய் எதிர்ப்பு சக்தியை அதிகரிக்க</li>
      <li>இளமை காத்து நீண்டகாலம் வாழ உதவும் சித்தர்கள் கலை.</li>
      
    </ol>
  `,
    startDate: "2026-06-07",

    time: "காலை 9.45 முதல் மதியம் 1.00 மணி வரை",

    location: {
      name: `ராதா நகர் மனவளக்கலை மன்றம் அறக்கட்டளை`,
      address: `ராதா நகர் அறக்கட்டளை,  7, ஏழுமலை தெரு, ராதா நகர், குரோம்பேட்டை, சென்னை - 14`,
      mapUrl: "https://maps.app.goo.gl/79NXJfmpWS5KgV6YA",
    },

    contacts: ["9884374090", "9962206217"],

    cancelled: false,
  },

  {
    id: "சிறப்பு தத்துவவிளக்கப்பயிற்சி-13-06-2026",
    title: "சிறப்பு தத்துவவிளக்கப்பயிற்சி ",
    programType: "single",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-06",
    instructors: ["மு.பே விவேகானந்தம் அய்யா - இணை இயக்குனர் SMART"],
    startDate: "2026-06-13",
  },

  {
    id: "அகத்தாய்வு-20-06-2026",
    title: "அகத்தாய்வு 3",
    programType: "range",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை. சனி, ஞாயிறு",
    monthKey: "2026-06",
    startDate: "2026-06-20",
    endDate: "2026-06-21",
  },

  {
    id: "அமாவாசை-14-06-2026",
    title: "அமாவாசை  மௌனம் ",
    programType: "single",
    time: "காலை 10.00 முதல் மதியம் 4.00 மணி வரை",
    monthKey: "2026-02",
    startDate: "2026-06-14",
    instructors: ["முதுநிலை பேராசிரியர். வசந்தவள்ளி அம்மா "],
  },

  {
    id: "ஆழ்நிலை-தியானம்-28-06-2026",
    title: "ஆழ்நிலை தியானம்",
    programType: "single",
    monthKey: "2026-06",
    location: {
      name: "குரோம்பேட்டை ராதா நகர் மனவளக்கலை மன்றம் அறக்கட்டளை",
      address: "No. 7 ஏழு ஏழுமலை தெரு ராதா நகர் குரோம்பேட்டை",
      mapUrl: "https://g.co/kgs/YKNV6g",
    },
    time: "ஞாயிற்றுக்கிழமை காலை 9.45 முதல் மாலை 4 மணி வரை",
    description:
      "தகுதி அகத்தாய்வு மூன்றாம் நிலை முடித்திருக்க வேண்டும்.அன்பர்கள் அனைவருக்கும் உணவுவழங்கப்படுவதால் எல்லோரும் பெயரை பதிவு செய்து கொள்ள வேண்டுகிறோம்  வாழ்க வளமுடன் ",
    contacts: ["9884374090", "9962206217"],

    startDate: "2026-06-28",
  },
];
